-- bootstrap lazy.nvim, LazyVim and your plugins
vim.g.lazyvim_alpha_header = {
  "██╗      █████╗ ██╗   ██╗██╗   ██╗██╗███╗   ███╗",
  "██║     ██╔══██╗██║   ██║██║   ██║██║████╗ ████║",
  "██║     ███████║██║   ██║██║   ██║██║██╔████╔██║",
  "██║     ██╔══██║██║   ██║██║   ██║██║██║╚██╔╝██║",
  "███████╗██║  ██║╚██████╔╝╚██████╔╝██║██║ ╚═╝ ██║",
  "╚══════╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝╚═╝     ╚═╝",
  "             🚀 PAYMAKER VIM 🚀",
}
vim.api.nvim_create_autocmd("FileType", {
  pattern = "blade",
  callback = function()
    vim.bo.syntax = "html"
  end,
})
vim.api.nvim_create_autocmd("BufWritePre", {
  pattern = { "*.blade.php", "*.html" },
  callback = function()
    local view = vim.fn.winsaveview()
    vim.cmd("normal! gg=G")
    vim.fn.winrestview(view)
  end,
})
vim.opt.termguicolors = true
require("config.lazy")
